---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.AddValue(Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue)
source: html/26518198-1bce-4119-da60-888e62785ba4.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.AddValue Method

Adds a value to the value set for this demand factor definition

## Syntax (C#)
```csharp
public void AddValue(
	ElectricalDemandFactorValue dfValue
)
```

## Parameters
- **dfValue** (`Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue`) - Value to add to the set

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null